notes/ten/social/init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-27 Tue 19:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../../src/style.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4525bcb">1. Public Administration</a></li>
<li><a href="#org3e63115">2. Importance/ Significants of Public Administration</a></li>
<li><a href="#org8f103f0">3. Bureaucracy</a></li>
<li><a href="#org0a5bb8f">4. Bureaucracy in India</a></li>
<li><a href="#orge8a77a7">5. Indian Civil Service</a></li>
<li><a href="#orge6f6bad">6. Administrative Reforms</a></li>
<li><a href="#orge5afd06">7. E-Governance</a></li>
<li><a href="#orge43004f">8. Right to Information</a></li>
<li><a href="#org3c5cff4">9. Information Commission</a></li>
<li><a href="#org58457df">10. Right to Service</a></li>
<li><a href="#org13bd123">11. Lokpal and Lokayuktha</a></li>
<li><a href="#org73cdf07">12. Central Vigilance Commission</a></li>
<li><a href="#org7afcadb">13. Ombudsman</a></li>
</ul>
</div>
</div>
<button class="sidebar-toggle">☰</button>
<aside class="sidebar">
<button class="close-sidebar">&times;</button>
<nav class="sidebar-menu">
<a href="https://abhi-xyz.github.io/website/">Home</a> <!-- Link to your homepage -->
<a href="../about.html">About</a> <!-- Link to your about page -->
<a href="../services.html">Services</a> <!-- Link to your services page -->
<a href="../contact.html">Contact</a> <!-- Link to your contact page -->
</nav>
</aside>

<div id="outline-container-org4525bcb" class="outline-2">
<h2 id="org4525bcb"><span class="section-number-2">1.</span> Public Administration</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Government Institutions and Their Functions</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Institution</th>
<th scope="col" class="org-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Primary Health Center</td>
<td class="org-left">Provides treatment facilities</td>
</tr>

<tr>
<td class="org-left">Krishi Bhavan</td>
<td class="org-left">Promotes agriculture</td>
</tr>

<tr>
<td class="org-left">Police Station</td>
<td class="org-left">Maintains law and order</td>
</tr>

<tr>
<td class="org-left">School</td>
<td class="org-left">Provides education</td>
</tr>

<tr>
<td class="org-left">Panchayat Office</td>
<td class="org-left">Facilitates local governance and development</td>
</tr>

<tr>
<td class="org-left">Post Office</td>
<td class="org-left">Manages postal services and financial transactions</td>
</tr>

<tr>
<td class="org-left">Electricity Board</td>
<td class="org-left">Ensures electricity supply and maintenance</td>
</tr>

<tr>
<td class="org-left">Water Authority</td>
<td class="org-left">Provides clean water and sanitation services</td>
</tr>

<tr>
<td class="org-left">Revenue Office</td>
<td class="org-left">Handles land records and tax collection</td>
</tr>

<tr>
<td class="org-left">Transport Department</td>
<td class="org-left">Manages public transport and vehicle registration</td>
</tr>
</tbody>
</table>

<p>
"Public Administration is concerned with the administration of the government."
<b>N. Gladden</b>
</p>

<p>
<b>Definition:</b> Public administration is the effective utilization of men and materials for the implementation of existing laws, governmental policies, programmes and developmental projects.
</p>

<ul class="org-ul">
<li>In a democracy, it emphasizes serving the people’s needs and ensuring their welfare.</li>
</ul>
</div>
</div>

<div id="outline-container-org3e63115" class="outline-2">
<h2 id="org3e63115"><span class="section-number-2">2.</span> Importance/ Significants of Public Administration</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Formulate governmental policies</li>
<li>Provide goods and services</li>
<li>Ensure welfare of the people</li>
<li>Findout solutions to public issues</li>
</ul>

<p>
Public administration plays a vital role in implementing policies, providing services, and ensuring the welfare of society. Gandhiji's vision of Grama Swaraj emphasized decentralization and the protection of vulnerable groups, which has deeply influenced India's approach to public administration.
</p>

<p>
Gandhiji's emphasis on Grama Swaraj shows the importance of local self-governments in making public administration more accessible and effective at the grassroots level.
</p>
</div>
</div>

<div id="outline-container-org8f103f0" class="outline-2">
<h2 id="org8f103f0"><span class="section-number-2">3.</span> Bureaucracy</h2>
<div class="outline-text-2" id="text-3">
<p>
Bureaucracy is essential for the functioning of public administration, ensuring that government services reach the people efficiently. Bureaucrats, who are the backbone of this system, make decisions, implement policies, and manage day-to-day activities across all levels of government.
</p>

<p>
<b>Key Features of Bureaucracy:</b>
</p>

<p>
<b>1) Hierarchical organisation</b>
</p>
<ul class="org-ul">
<li>Bureaucracy is organised in such a way that there is one employee at the top and the number increases when it reaches the lower levels. This is known as hierarchical organisation.</li>
</ul>

<p>
<b>2) Permanence</b>
</p>
<ul class="org-ul">
<li>Persons appointed will continue in service till the age of retirement.</li>
</ul>

<p>
<b>3) Appointment on the basis of Qualification</b>
</p>
<ul class="org-ul">
<li>Employees are recruited and appointed on the basis of educational qualification.</li>
</ul>

<p>
<b>4) Political Neutrality</b>
</p>
<ul class="org-ul">
<li>Bureaucrats are liable to implement the policies of whichever party comes to power. Party interests should not reflect in their work. They should act neutrally.</li>
</ul>

<p>
<b>5) Professionalism</b>
</p>
<ul class="org-ul">
<li>Every government employee must be skilled in their work.</li>
</ul>

<p>
These features contribute to an efficient public administration system, which is vital for the development of a country.
</p>
</div>
</div>

<div id="outline-container-org0a5bb8f" class="outline-2">
<h2 id="org0a5bb8f"><span class="section-number-2">4.</span> Bureaucracy in India</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>Recruitment Process:</b>
</p>

<p>
The recruitment process in India is primarily conducted through competitive exams, interviews, and screenings. The Kerala Public Service Commission (PSC), as well as the Union Public Service Commission (UPSC), are responsible for recruiting candidates based on merit. This structured and merit-based system ensures that qualified individuals are appointed to serve in various government departments, contributing to efficient governance.
</p>

<p>
In India, the civil service is a structured system of government employees who work at various levels, from the central to the state governments and public sector undertakings. These employees play a crucial role in implementing government policies, managing day-to-day operations, and ensuring that public services reach the people effectively.
</p>
</div>
</div>

<div id="outline-container-orge8a77a7" class="outline-2">
<h2 id="orge8a77a7"><span class="section-number-2">5.</span> Indian Civil Service</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>All India Services</b>
</p>
<ul class="org-ul">
<li>Recruits at national level</li>
<li>Appoints in central or state service</li>
<li><b>Eg:</b> Indian Administrative Service, Indian Police Service</li>
</ul>

<p>
<b>Central Services</b>
</p>
<ul class="org-ul">
<li>Recruits at national level</li>
<li>Appoints in central government departments only</li>
<li><b>Eg:</b> Indian Foreign Service, Indian Railway Service</li>
</ul>

<p>
<b>State Services</b>
</p>
<ul class="org-ul">
<li>Recruits at state level</li>
<li>Appoints in state government departments only</li>
<li><b>Eg:</b> Sales tax officer.</li>
</ul>

<p>
<span class="underline">Candidates to all India services and central services are recruited by the Union Public Service Commission (UPSC)</span>. The chairman and the members of this commission are appointed by the President of India. The UPSC has elaborate mechanisms for the recruitment of candidates
based on qualification.
</p>

<p>
<span class="underline">At the state level, candidates are recruited by the Public Service Commission (PSC)</span> of the State. The Governor appoints the Chairman and the members of the State Public Service Commission. UPSC and State PSC’s are constituted on the basis of constitutional provisions. So they are called constitutional institutions.
</p>

<p>
Hierarchical organisation, one of the significant features of bureaucracy creates delay in taking decision in administrative field.
</p>

<p>
To solve this and provide better service easily, the government has taken certain steps. Let us examine them.
</p>
</div>
</div>

<div id="outline-container-orge6f6bad" class="outline-2">
<h2 id="orge6f6bad"><span class="section-number-2">6.</span> Administrative Reforms</h2>
<div class="outline-text-2" id="text-6">
<p>
A number of steps are taken by the government for increasing the efficiency of the services and to provide service to people in a time bound manner. They are known as administrative reforms. The intention is to make administration people friendly and efficient. 
</p>
</div>
</div>

<div id="outline-container-orge5afd06" class="outline-2">
<h2 id="orge5afd06"><span class="section-number-2">7.</span> E-Governance</h2>
<div class="outline-text-2" id="text-7">
<p>
E-Governance leverages technology to improve administrative processes, making government services more accessible, efficient, and cost-effective. 
</p>

<p>
<b>Example:</b>
</p>
<ul class="org-ul">
<li>Higher Secondary courses, online applications for various scholarships.</li>
</ul>

<p>
<b>Benefits:</b>
• Can receive service with the help of information technology.
• Need not to wait in government offices for services.
• Government services offered speedily and with less expense.
• Efficiency of the offices and quality of the service get enhanced.
</p>

<p>
These facilities are now available in all government offices. The basic facilities are ensured to all through the Akshaya Centres in Kerala. People can receive the services of E-governance at home with the spread of E-literacy.
</p>
</div>
</div>

<div id="outline-container-orge43004f" class="outline-2">
<h2 id="orge43004f"><span class="section-number-2">8.</span> Right to Information</h2>
<div class="outline-text-2" id="text-8">
<p>
<b>The Right to Information Act of 2005</b> empowers citizens to request information from any government office, promoting transparency, accountability, and preventing corruption. This law represents a significant step toward making the functioning of the government more open and accessible to the public.
</p>

<p>
<b>Key Aspects of the Right to Information Act:</b>
</p>

<ol class="org-ol">
<li>Citizen Empowerment</li>
<li>Transparency in Governance</li>
<li>Prevention of Corruption</li>
<li>Responsibility and Accountability</li>
<li>Access to Public Documents</li>
</ol>

<p>
The <b>RTI Act</b> is a powerful tool for citizens to engage with the government and ensure that it operates in a fair and transparent manner. The citizens will get copies of public documents if they apply for them.
</p>
</div>
</div>

<div id="outline-container-org3c5cff4" class="outline-2">
<h2 id="org3c5cff4"><span class="section-number-2">9.</span> Information Commission</h2>
<div class="outline-text-2" id="text-9">
<p>
The Information Commission is an essential body established under the Right to Information (RTI) Act to ensure the smooth functioning of the law at both the national and state levels. 
</p>

<p>
There will be a <b>Chief Information Commissioner</b> and <b>not more than ten members</b> in the Information Commission. 
<span class="underline">If the authorities do not give, or refuse to give the information or gave wrong and unsatisfactory replies, one can approach the Information Commission and can file an appeal</span>. If the commission is convinced, <b>a fine of Rs. 250 per day</b> can be imposed on the employee concerned till the information is given.
</p>
</div>
</div>

<div id="outline-container-org58457df" class="outline-2">
<h2 id="org58457df"><span class="section-number-2">10.</span> Right to Service</h2>
<div class="outline-text-2" id="text-10">
<p>
<b>The Right to Service Act</b> is a significant law that ensures the timely delivery of various government services to citizens. This legislation mandates that government offices provide services within a specified time frame, ensuring accountability and efficiency in public administration.
</p>

<p>
<b>Key Features of the Right to Service Act:</b>
</p>

<ol class="org-ol">
<li>Time-bound Services</li>
<li>Penalty for Delays</li>
<li>Designated Officer</li>
<li>Citizen Empowerment</li>
<li>Civil Society's Role</li>
</ol>
</div>
</div>

<div id="outline-container-org13bd123" class="outline-2">
<h2 id="org13bd123"><span class="section-number-2">11.</span> Lokpal and Lokayuktha</h2>
<div class="outline-text-2" id="text-11">
<p>
Lokpal and Lokayukta are <b>anti-corruption institutions</b> established to tackle corruption in public administration, bureaucracy, and politics. These institutions are part of India's efforts to promote transparency and accountability in governance.
</p>

<ul class="org-ul">
<li><b>Lokpal</b> has the power to register cases on issues of corruption against employees and public workers and can suggest necessary actions.</li>

<li><b>Lokayukta</b> is the institution constituted at the state level to hear the corruption cases.</li>
</ul>

<p>
Both of them follow judicial procedures.
</p>
</div>
</div>

<div id="outline-container-org73cdf07" class="outline-2">
<h2 id="org73cdf07"><span class="section-number-2">12.</span> Central Vigilance Commission</h2>
<div class="outline-text-2" id="text-12">
<p>
<b>The Central Vigilance Commission</b> is a crucial institution in India established to combat corruption within central government offices.
</p>

<ul class="org-ul">
<li>Established in <b>1964</b></li>
<li>Objective is to prevent and address corruption in central government offices and ensure transparency and accountability in public administration.</li>
</ul>

<p>
<b>Structure:</b>
</p>

<ol class="org-ol">
<li><b>Central Vigilance Commissioner</b> is The head of the CVC</li>
<li><b>Chief Vigilance Officer (CVO)</b> is appointed in various central government departments to handle vigilance issues and report to the CVC.</li>
</ol>

<p>
<b>Duties:</b>
</p>

<ul class="org-ul">
<li>to enquire into vigilance cases and take necessary actions.</li>
<li>Recommends necessary actions against individuals found guilty of corruption.</li>
</ul>
</div>
</div>

<div id="outline-container-org7afcadb" class="outline-2">
<h2 id="org7afcadb"><span class="section-number-2">13.</span> Ombudsman</h2>
<div class="outline-text-2" id="text-13">
<p>
The Ombudsman is a key institution designed to address grievances against public officials and institutions, ensuring transparency and accountability.
</p>

<ul class="org-ul">
<li>a <b>retired High Court Judge</b> is appointed as the Ombudsman.</li>
<li>has the power to summon individuals, conduct inquiries, and recommend actions based on findings.</li>
<li><b>people can directly approach the Ombudsman</b> with complaints regarding the conduct of public officials.</li>
<li><b>Objective</b> is <span class="underline">to address complaints related to corruption, nepotism, financial misappropriation, or negligence of duties by elected representatives and bureaucrats</span>.</li>
<li><b>Acts as a mediator</b> between the public and government institutions to resolve issues and improve administrative practices.</li>
<li>The Ombudsman can investigate complaints, summon witnesses, and gather evidence.</li>
<li>After the inquiry, the Ombudsman can recommend corrective actions or disciplinary measures to address the issues.</li>
<li>Ensures that delays in service or denial of rights are addressed promptly.</li>
<li>reinforces the principle that <b>government services are a right of the people, not a favor</b>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-08-27 Tue 19:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
